# Реализовать проект расчета суммарного расхода ткани на производство одежды.
# Основная сущность (класс) этого проекта — одежда, которая может иметь определенное название.
# К типам одежды в этом проекте относятся пальто и костюм.
# У этих типов одежды существуют параметры: размер (для пальто) и рост (для костюма).
# Это могут быть обычные числа: V и H, соответственно.
# Для определения расхода ткани по каждому типу одежды использовать формулы: для пальто (V/6.5 + 0.5),
# для костюма (2 * H + 0.3). Проверить работу этих методов на реальных данных.
# Реализовать общий подсчет расхода ткани.
# Проверить на практике полученные на этом уроке знания: реализовать абстрактные классы для основных классов проекта,
# проверить на практике работу декоратора @property.
from functools import reduce

from Suit import Suit
from Сoat import Coat

suit = Suit(h=30)
coat = Coat(v=40)

print('Coat: ', coat.expensive)
print('Suit: ', suit.expensive)


def count_all_clothes_expensive(clothes):
    return reduce(lambda el_prev, el: el.expensive + el_prev.expensive, clothes)


print("All: ", count_all_clothes_expensive([suit, coat]))
